{"slug":"2023-11-neues-logo","html":"<p>Die neue Major-Version 17 von Angular wurde Anfang November veröffentlicht. Für das Team und die Community war es ein besonderes Release: Angular wartet nicht nur mit spannenden neuen Features auf, sondern präsentiert sich seit 6. November 2023 in einem neuen Gewand.</p>\n<h2 id=\"das-neue-logo\">Das neue Logo</h2>\n<p>Das bisherige Angular-Logo ist in der Community weithin bekannt: Das weiße A auf rotem Schild ziert nicht nur die offizielle Website von Angular, sondern prangt auch auf beklebten Laptops, Konferenzen, Meetups, Community-Librarys und nicht zuletzt auch auf unserem Angular-Buch.\nGleichzeitig schaut das Logo auf eine lange Geschichte zurück: Die erste Version wurde ab 2012 mit dem Vorgänger-Framework &quot;AngularJS&quot; bekannt und hatte einen charakteristischen grauen Rand.\nIm September 2016 wurde das neue Framework &quot;Angular&quot; veröffentlicht, das eine vollständige Neuentwicklung war – Name und Logo blieben jedoch grundlegend erhalten.</p>\n<p>In den letzten zwei Jahren hat Angular eine starke Entwicklung vollzogen. Standalone Components, Signals, Control Flow, die Funktion <code>inject()</code>, funktionale Guards/Interceptoren und Typed Reactive Forms sind nur eine Auswahl der neuen Features.\nVon Kritikerinnen und Kritikern hören wir gelegentlich das Feedback, Angular sei &quot;tot&quot; oder werde &quot;nicht mehr weiterentwickelt&quot;.\nDoch das Gegenteil ist der Fall: Angular wird allein innerhalb des Konzerns Google in über 1.200 Anwendungen produktiv eingesetzt. Es ist eins der führenden Frameworks, um Webanwendungen für den Enterprise-Bereich zu entwickeln und ist den anderen großen Frameworks wie Vue.js oder React ebenbürtig.</p>\n<p>Es weht ein frischer Wind aus Kalifornien, das Angular-Team und die Community sind hoch motiviert.\nUm dieses &quot;Momentum&quot; nicht nur auf technischer Ebene sichtbar zu machen, präsentiert sich Angular seit Version 17 mit einem neuen Logo und einer neuen Website.\nDas neue Logo wurde am 6. November 2023 feierlich veröffentlicht, nachdem das Team über ein Jahr an der neuen Präsentation gearbeitet hat.\nDie bekannte Schildform bleibt erhalten, aber statt einer einfachen Farbfläche wird das Logo durch einen modernen Farbverlauf definiert.</p>\n<blockquote>\n<p><strong>Das neue Angular-Portal finden Sie unter <a href=\"https://angular.dev\">//angular.dev</a>.</strong></p>\n</blockquote>\n<div style=\"margin: auto\">\n  <img src=\"%%MARKDOWN_BASE_URL%%/blog/2023-11-neues-logo/logo-history.png\" alt=\"Geschichte des Logos\">\n  <p><small>Das Angular-Logo im Wandel der Zeiten: AngularJS (2012), Angular (2016), Angular (2023)</small></p>\n</div>\n\n\n\n<h2 id=\"angularschule-wir-machen-mit\">Angular.Schule: Wir machen mit!</h2>\n<p>Die Angular.Schule ist einer der führenden Anbieter für Angular-Schulungen im deutschsprachigen Raum. Es ist unsere Vision und Leidenschaft, unser Wissen über das Framework Angular zu vermitteln. Seit 2017 führen wir regelmäßig Schulungen in Präsenz und online durch und beraten mittelständische Unternehmen zum Einsatz von Angular.</p>\n<p>Wir sind glücklich über den Kurs des Frameworks und begrüßen auch das neue Logo sehr.\nVon Beginn an waren wir eng mit Angular und der Community verbunden. Das neue Logo und die frischen Farben greifen wir deshalb jetzt auch in unserem Logo und unserer Webpräsenz auf.</p>\n<p>Darüber hinaus bleibt bei uns alles in gewohnter Qualität: Wir – die Google Developer Experts (GDE) Ferdinand Malcher und Johannes Hoppe – bieten Ihnen weiterhin hochwertige Schulungen und Beratungsleistungen zu Angular an, persönlich und aus erster Hand.\nDabei sind unsere Schulungen auf dem neuesten technischen Stand, und wir bieten stets Einblicke in aktuelle und zukünftige Entwicklungen von Angular. Als GDEs profitieren wir dabei von unserem persönlichen Kontakt zum Angular-Team und der Community.</p>\n<h2 id=\"neu-in-angular-17\">Neu in Angular 17</h2>\n<p>Das neue Angular 17 bringt nicht nur ein neues Logo, sondern auch eine Reihe von neuen Features mit.\nEine Auswahl der wichtigsten Neuigkeiten:</p>\n<ul>\n<li>Neue Syntax für den Control Flow: <code>@if</code>, <code>@for</code> und <code>@switch</code></li>\n<li>Deferrable Views, um Teile von Templates erst zur Laufzeit nachzuladen: <code>@defer</code></li>\n<li>Neuer Application Builder auf Basis von ESBuild mit besserer Performance und Support für SSR und Pre-Rendering</li>\n</ul>\n<p><strong>Auf der Website unseres Angular-Buchs berichten wir ausführlich über alle Neuerungen: <a href=\"https://angular-buch.com/blog/2023-11-angular17\">Angular 17 ist da!\n</a></strong></p>\n","meta":{"title":"Angular hat ein neues Logo – wir auch!","author":"Angular.Schule Team","mail":"team@angular.schule","published":"2023-11-06T00:00:00.000Z","lastModified":"2023-11-06T00:00:00.000Z","keywords":["Angular","Angular.Schule","Logo","Angular 17"],"language":"de","header":{"url":"header-logo.png","width":2000,"height":881},"hidden":false,"sticky":false,"darkenHeader":false}}
