{"slug":"2018-01-cfp-dwx2018-angular","html":"<p>In meiner Rolle als <a href=\"https://www.developer-week.de/adboard/\">Track-Chair</a> für den Themenbereich <strong>Angular</strong> wurde ich mehrfach gefragt, nach welchen Kriterien ich die Auswahl treffen werde.</p>\n<p>Der Track soll einen ganzheitlichen Einblick in die Welt von Angular für Einsteiger sowie fortgeschrittene Entwickler bieten. Es werden Vorträge zu Themen gesucht, die bei der <strong>Lösung konkreter Aufgaben</strong> helfen bzw. die den Herausforderungen von Angular-Anwendungen begegnen. Gern gesehen ist ebenso die Vorstellung neuester <strong>Trends und Tools</strong>, welche einen direkten Bezug zu Angular haben. Die Themenliste mit meinen heißen Kandidaten beinhaltet unter anderem:</p>\n<ul>\n<li>Einführung / Grundlagen</li>\n<li>PWA (Progressive Web Apps)</li>\n<li>Internationalisierung (i18n, ngx-translate)</li>\n<li>Performance-Optimierung, Optimierung Größe</li>\n<li>UI-Bibliotheken wie Angular Material, Angular Elements, Kendo UI, ...</li>\n<li>Angular Animations</li>\n<li>Angular Forms, Dynamic Forms</li>\n<li>Server-Side Rendering (SSR)</li>\n<li>Redux und Reactive (NgRx, angular-redux, RxJS, ...)</li>\n<li>Testing</li>\n<li><em>Dein Vorschlag!?</em></li>\n</ul>\n<p>Ich möchte, dass ein Konferenz-Teilnehmer sich, mit einem Bleistift bewaffnet, in jeden der Talks setzen kann und am Ende einen echten Mehrwert für seine Arbeit mit nach Hause nimmt. Aus dem Abstract muss klar zu erkennen sein, dass sowohl Einsteiger abgeholt werden, aber auch fortgeschrittene Entwickler sich nicht langweilen werden. In der Microsoft-Welt würde man sagen: mindestens <a href=\"https://technet.microsoft.com/en-us/security/cc558964.aspx\">Level</a> 100/200 und vielleicht eine Prise 300. Diesen schwierigen Spannungsbogen hinzubekommen, ist eure Herausforderung!</p>\n<p>Üblicherweise kommt eine Menge an Themen doppelt herein. Wer also eine &quot;Einführung in Angular mit TypeScript&quot; oder &quot;Angular Forms&quot; (jeder macht Forms) einreicht, muss sich gegen viele andere ähnliche Vorschläge positionieren. Bitte beschwert euch nicht, wenn ein anderer Vortrag zum selben Thema gewählt wurde! Das krasse Gegenteil wäre ein Nischenthema. Das ist auch keine gute Idee. Ich muss den Saal einigermaßen voll bekommen. Es ist für alle Beteiligten (Veranstalter, Speaker, Zuhörer) ein beklemmendes Gefühl, wenn nur 3 Personen im Saal anwesend sind. Ein Vortrag mit z.B. dem Titel &quot;Von Ext JS nach Angular migrieren&quot; hat daher keine Chance, weil in Deutschland ganz einfach die Nutzerbasis fehlt.</p>\n<p>Jetzt aber los!\nDer CFP endet am 14. Januar 2018, genau zur Mitternacht.</p>\n<h3 id=\"reicht-eure-talks-zum-themenbereich-angular-hier-ein-call-for-papers-dwx-2018\">Reicht eure Talks zum Themenbereich &quot;Angular&quot; hier ein: <a href=\"https://www.developer-week.de/call-for-papers/\">Call for Papers DWX 2018</a></h3>\n","meta":{"title":"CFP: Angular-Track bei der DWX 2018","author":"Johannes Hoppe","mail":"johannes.hoppe@haushoppe-its.de","published":"2018-01-10T00:00:00.000Z","keywords":["Angular","DWX","CFP"],"language":"de","header":{"url":"dwx2018-header.jpg","width":940,"height":208},"hidden":false,"sticky":false,"darkenHeader":false}}
